apitests/pollForIncomingTextKey.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" >
 <soap:Body>
  <pollForIncomingTextKey_Key xmlns="https://secure.textkey.com/services/">
   <apiKey>PUT API KEY HERE</apiKey>
   <textKey>5868199</textKey>
  </pollForIncomingTextKey_Key>
 </soap:Body>
</soap:Envelope>
